Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja4/kirsten-s.htm.tmx
Source language: sme
Languages: nob

source: Mun čuoččahin , dollejin su gihtii ja nejjestin čábbát .
nob: Jeg reiste meg , tok han i hånden og neide pent .

source: De son dajai : « Galggat dennjet et bohcco . »
nob: Så sa han ; « Du må tegne en rein » .

source: In ipmirdan manne , muhto álgen sárgut bohcco .
nob: Jeg skjønte ikke hvorfor , men jeg begynte å tegne .

source: Son geahčai govvii ja nivkalii .
nob: Han så på tegningen og nikket .

source: Eará oahppit ožžo maiddái dennjenbarggu .
nob: De andre hadde også fått tegneoppgaver .

source: De mii juhkkojuvvuimet moatti jovkui .
nob: Deretter ble vi delt inn i grupper .

source: Mun šadden B-klássii .
nob: Jeg kom i B-klassen .

source: Nu sii juhke ohppiid guhtege máhtolašvuođa mielde .
nob: Noen kom i A. På den måten nivå-delte de klassene .

source: Muđui muittán bures min dálueamida , danne go son háliidii cokkahit munnje gávtti ja dolvvodit mu oahppásiiddis lusa go son ii lean barggus .
nob: Ellers så husker jeg godt husmor , fordi hun likte å ta på meg kofta og dra på besøk til sine venner når hun hadde fri .

source: Moai vácciime gáhta mielde , son čájáhalai mu olbmuide , ja de manaime oahppaladdat muhtun olbmuid .
nob: Da gikk vi i gata slik at hun kunne vise meg frem og så på besøk til noen .

source: Muhtumin lei juo maŋŋit eahket go vulggiime , ledjen váiban hirbmadit go bođiime fas ruovttoluotta .
nob: Det kunne bli sene kvelder og jeg var ofte trøtt og sliten når vi kom tilbake .

source: Nuppe beaivvi ledjen váibbas skuvllas .
nob: Neste morgen var jeg trøtt på skolen .

source: Nu lei dassážii go ollejin 3. dehe 4.klássii .
nob: Dette varte helt til jeg kom i 3. eller 4. klasse .

source: Oainnát go soahti nogai , de besse buot oahppit vuolgit ruoktot .
nob: Da krigen var over , kunne alle elevene reiste hjem .

source: Mun mannen Návutnii , ja áhčči ja eadni vieččaiga mu .
nob: Jeg reiste til Kvænangen og mor og far kom og hentet meg .

source: Dadjen eadnásan ahte in fuola šat sámi biktasiid skuvlii .
nob: Der sa jeg til mor at jeg ikke ville ha samiske klær på skolen .

source: Sihten su čiehkat daid biktasiid eret , dehe addit daid Ellii , mu fuolkái .
nob: Jeg ville hun skulle gjemme dem hjemme . Eller gi dem til Ellen , min slektning .

source: Ledjen nu gallánan dasa go dálueamit ja earát dolvo mu olbmuid lusa gáfeguossái čájáhussan .
nob: Jeg var så lei av at husmor og andre lærere tok meg med ut på kaffebesøk for å vise meg fram .

source: Mun goit háliidin stoahkat mánáiguin bealjehemiid skuvllas .
nob: Jeg ville jo leke med barna på døveskolen .

source: Lávejin jur nu váibat go šadden dakkár čájáhussan , muhto dan gal in muitalan eadnásan .
nob: Det var et slit å bli vist frem på det viset . Men det siste sa jeg ikke til mor .

source: Go de šattai fas čakča ja bohten fas bealjehemiid skuvlii , de jearai dálueamit mu sámi biktasiid .
nob: Så da høsten kom og jeg var tilbake på døveskolen spurte husmor etter mine sameklær .

source: Son logai mu jallan go ledjen guođđán daid ruoktot .
nob: Hun sa jeg var dum som hadde lagt dem igjen hjemme .

source: In vástidan .
nob: Jeg svarte ikke .

source: In nagodan šat .
nob: Jeg orket ikke .

source: Rektora mielas maiddái livččen galgan váldit mielde sámi biktasiiddan .
nob: Rektor mente også at jeg skulle ha tatt med meg sameklærne .

source: Jurddaš go šadden vuolgit sin mielde juohke lávvordaga .
nob: Tenk at jeg måtte være med dem hver lørdag .

source: Ledjen nu váivahuvvan .
nob: Jeg var så lei .

source: Eará oahppit gal gáđaštedje mu .
nob: Men de andre elevene var sjalu på meg .

source: Sii oidne ahte dušše mun dat bessen vuolgit olbmuid guossái juohke lávvordaga , bessen borrat gáhkuid ja eará njálgáid .
nob: De så bare at jeg fikk være med på besøk hver lørdag og spise kaker og annet godt .

source: Sin mielas ledjen mun « ánuheaddji » .
nob: De syntes jeg var en « tigger » .

source: Danne mun in šat beroštan mastege sámis .
nob: Derfor ga jeg blaffen i alt det samiske .

source: Dađibahábut in ožžon šat dálueamidis sámebiktasiiddan , daid mat mus ledje go dalle go bohten dohko .
nob: Dessverre fikk jeg ikke tilbake mine samiske klær fra husmor .

source: Dat gal jávke áibbas .
nob: De jeg hadde når jeg kom .

source: Munnje lea dat leamaš bávččasin .
nob: De ble borte . Det har smertet meg .

source: Eadnán jearai mus sámi biktasiid go máhccen fas ruoktot . In diehtán vástidit .
nob: Min mor spurte etter klærne da jeg kom hjem og jeg kunne ikke svare .

source: Heahpanin .
nob: Det var flaut .

source: Dieđán ahte internáhta dálueamit dat čiegai daid loktii vai eará mánát eai vikka geahččaladdat daid .
nob: Jeg vet at husmor gjemte på dem på loftet på skolen fordi det var så mange elever som ville prøve klærne mine .

source: Eai biktasat gal dihton dađi eanet .
nob: Men de kom aldri til rette igjen .

source: Go bohten skuvlii vuohččan , de gárvvuhedje mu ja dolvo mu govvejeaddji lusa .
nob: Da jeg kom til skolen første gang ble jeg forresten kledd opp og tatt med til fotograf .

source: Čálle aviisii mu birra .
nob: Det ble skrevet i avisen meg .

source: Lei vissa erenoamáš dáhpáhus go sámi nieiddaš bođii skuvlii sámegávttiin .
nob: Det var visst en begivenhet at det kom ei samejente til skolen kledd i kofte .

source: Ožžon dan gova muhtun jagiid maŋŋil .
nob: Jeg fikk det bildet noen år senere .

source: In dalle diehtán ahte dat lei leamaš aviissas .
nob: Jeg visste ikke da at det hadde vært i avisen .

source: Eai bealjehemiid skuvllas hupman nu ollu sápmelaččaid birra .
nob: Men det var lite prat om samer på døveskolen .

source: Ii dan dihte lean gal mu mielas váttis doppe sápmelažžii , dehe heivehit iežas dáru kultuvrii .
nob: Likevel opplevde jeg ikke at det å være same som vanskelig . Heller ikke at det var vanskelig å tilpasse seg en norsk kultur .

source: Dat ášši ii lean sáhkan doppe .
nob: Det var bare ikke et tema .

source: Jos mus jerre lean go sápmelaš , de dadjan álo ahte lean .
nob: Ble jeg spurt om jeg var same sa jeg alltid ja .

source: Ii das lean šat dađi eanet .
nob: Mer var det ikke med det .

source: Áidna mii lei váttis , lei go šadden buot daid olbmuid lusa guossái .
nob: Det eneste som var vanskelig var alle disse besøkene .

source: Háliidin stoahkat earáiguin .
nob: Jeg ville helst leke med andre barn .

source: Buot dat gáhkut ja gáffe lei jur vuovssihahtti , ja fertejin giitit čábbát ja borrat .
nob: Jeg ble jo bare kvalm av kakene og kaffen og så måtte jeg takke pent og spise .

source: Ollesolbmuide lei dat suohtas , muhto ii mu mielas gal .
nob: De voksne hadde det hyggelig , men ikke jeg .

source: In ge mun ipmirdan maid sii hupme , sánit manne mu guora .
nob: Ikke skjønte jeg hva de pratet om , for det gikk over hodet på meg .

source: Ja lei ges dat ahte ollet ruoktot maŋŋiteahket , maŋŋel go buohkat ledje nohkkan , ledjen váibbas , ja de nuoladit ja velledit seŋgii .
nob: Og bare det å komme sent hjem , etter at alle hadde lagt seg , trøtt og sliten , kle av seg og komme seg i seng .

source: Muhtumin lávii diibmu guoktenuppelohkái dehe okta ihkku go máhcaimet fas skuvlii .
nob: Av og til kunne klokka bli både tolv og ett før vi var tilbake til skolen .

source: Iešalddis dat go ledjen sápmelaš gal ii daguhan makkárge váttisvuođaid .
nob: Men det å være samisk hadde jeg ingen problemer med .

source: Hupmat čielgasit , ii giehtagiela atnit
nob: Tale og artikulasjon , ikke tegnspråk

source: Skuvllas lei eanas aivve hupman ja artikulašuvdna ( čielgasit-cealkin ) diimmuin .
nob: På skolen var det mest tale og artikulasjon i timene .

source: Doppe ii lean lohpi atnit giehtagiela .
nob: Der var det ikke lov å bruke tegnspråk .

source: Lei dehálaš oahppat cealkit jienaid ja oahppat sániid , dárogillii dieđusge .
nob: Det var viktig at vi lærte å uttale lydene og lære ord , norsk selvfølgelig .

source: Mun dat gal ohppen jođánit .
nob: Men jeg lærte fort .

source: Mis ledje eará fágat , omd. rehkenastin .
nob: Vi hadde også andre fag , som for eksempel regning .

source: Das in gal lean nu čeahppi .
nob: Jeg var ikke så flink der .

source: Ii mis lean giehtagiella skuvladiimmuin .
nob: Vi hadde ikke tegnspråk i timene .

source: Jos doppe mettiimet atnit giehtagiela , de dearpaledje sii min suorpmaide cuoigunsoppiin .
nob: Brukte vi tegnspråk der inne fikk vi et rapp over fingrene med pekestokken .

source: Vikkaimet gal suoli atnit giehtagiela , muhto oahpaheaddji oinnii min dakkaviđe .
nob: Vi prøvde likevel i smug , men læreren oppdaget det fort .

source: Dušše friddjaáiggis mii oahppit aniimet giehtagiela gaskaneamet .
nob: Det var kun på fritiden vi brukte tegnspråk oss elever imellom .

source: Nuorabut ohppe boarráseappuin .
nob: De yngste lærte av de eldre .

source: Easka arvat maŋŋil álge atnit giehtagiela bealjehemiid skuvlla oahpahusas .
nob: Det var jo først mye senere at det ble brukt tegnspråk i undervisningen på døveskolen .

source: Oahpaheaddjit ja skuvlla bargit muđui doalahedje hui áŋgirit skuvlla njuolggadusaid , ledje garrasat , muhto goitge siivvut .
nob: Lærerne og de ansatte på skolen håndhevet reglene på skolen flittig . De var strenge , men likevel var de snille .

source: Na , gal soittii gal dat nai nuo ja ná .
nob: Vel , det var vel kanskje litt forskjellig det også da.

source: Sii bearráigehčče hui dárkilit dan mot mii gárvodeimmet .
nob: Vi ble veldig passet på i forhold til hvordan vi kledde oss .

source: Eai sis galgan buohcci mánát , ja mii galggaimet gárvodit čábbát .
nob: De skulle ikke ha syke barn og vi skulle være pent kledd .

source: Šlurváivuohta gal ii dohkkehuvvon .
nob: Der var det ikke rom for slurv .

source: Jos mannen olggos kovppa haga , de gal gevrejedje mu fas vissui coggat dan badjelasan .
nob: Hvis jeg gikk ut uten kåpe ble jeg sendt fort inn for å ta den på .

source: Mii vácciimet čuvllaiguin ja dálveskuovaiguin , ja easka miessemánus beasaimet coggat geasseskuovaid .
nob: Vi gikk i kjoler og støvletter og først når mai kom kunne vi få lov til å ta lette sko på oss .

source: Čakčamánus lei fas bággu coggat dálveskuovaid .
nob: Men i september var det tilbake med støvlettene .

source: Dálveskuovain ledje stállerávddat ja go buot oahppit vihke feaskáriin , de sáhtten gullat ahte čolkkii .
nob: De hadde stålkant og når alle elevene løp i gangene så kunne jeg høre at det klapret .

source: In mun gal gullan nu ollu , muhto in lean hárjánan jienaide .
nob: Jeg hørte nok ikke så mye , men jeg var ikke vant til lyder .

source: Meahcis lei nu jaskat ahte vásihin dan jiena riedjan .
nob: Det var så stille på fjellet så jeg opplevde det som bråk .

source: Ledjen dušše gullan beatnagiid šáikasa ja girdiid jurrama ovdal .
nob: Jeg hadde bare så vidt hørt hundeglam og flydur tidligere .

source: Dat lei ođđa vásáhus munnje .
nob: Det var en ny opplevelse .

source: Dálveskuovat godde maiddái julggiid váccidettiin .
nob: Støvlettene var også vonde å gå med .

source: Na nu hal dat nai lei .
nob: Men slik var det .

source: Skuvlabeaivi álggii diibmu 7:s iđitborramušain , ja de galggaimet skuvllas beaivvi miehtá .
nob: Dagen startet kl. 7 med frokost og så var det å være på skolen hele dagen .

source: Eai lean gal leavssut , muhto sierra leaksolohkandiibmu diibmu golmmas gitta diibmu njealji rádjái juohke beaivvi .
nob: Det var ikke lekser , men egen lesetime fra 15 til 16 hver dag .

source: De lei gaskabeaiborramuš , ja diibmu 17:s ges goarrun ja duddjon .
nob: Så var det middag og kl. 17 var det håndarbeide .

source: Mis lei diibmoplána olles beaivái gitta eahketborranáigái , diibmu 19:s , de gaccaimet buvrru .
nob: Vi hadde timeplan hele dagen frem til kveldmaten kl. 19 , som var grøt .

source: Nohkkanáigi lei diibmu 20:s .
nob: Leggetid var klokken 20 .

source: Ii lean gal ollu friddjaáigi .
nob: Det var ikke mye fritid .

source: Min ájihedje vel lávvordaga nai beaivvi miehtá .
nob: Vi ble beskjeftiget hele dagen , også lørdag .

source: Dalle čuoiggaimet ja muhtumin beasaimet geahččat ealligovaid .
nob: Da var det aktivitet som ski eller vi fikk også av og til dra på kino .

source: Sotnabeaivvi gal lei friddja earret de go galggaimet ipmilbálvalussii girkui .
nob: Søndag var fri , med unntak av at vi måtte på gudstjeneste .

source: Nu lei dilli bealjehemiid skuvllas .
nob: Slik var det på døveskolen .

source: Goitge golai áigi ovdal go ipmirdin manne mun šadden dan skuvlii .
nob: Men det tok tid før jeg skjønte hvorfor jeg skulle på skolen .

source: Dan gal ipmirdin fargga ahte lei dehálaš lohkat , čállit ja hupmat ja de konfirmerejuvvot .
nob: Det som jeg skjønte etter hvert var at det var viktig å lese , skrive og prate for så å bli konfirmert .

source: Ledjen bures juo ollen goalmmát dehe njealját skuvlajahkái go dan fuomášin .
nob: Jeg var vel godt opp i tredje eller fjerde klasse før det demret for meg .

source: Nubbi eará ášši lea go in ipmirdan ahte soahti lei váttis dilli olbmuide .
nob: En annen ting var at jeg heller ikke kan huske at jeg forsto at krigen var vanskelig for folk .

source: Ledjen oaidnán duiskka soalddáhiid fatnasis , ja sii ledje siivvut .
nob: Jeg hadde møtt tyske soldater på båten og de var snille .

source: Ledje addán munnje vel ruđa ja šukuláde nai .
nob: De hadde til og med gitt meg penger og sjokolade .

source: Oahppit hupme ollu Hitlera ja nazismma birra , go dat daguhedje bákku ja jápmima .
nob: Det ble pratet mye blant elevene om Hitler og nazismen og at det fulgte tvang og død med dem.

source: Go oidnen billistemiid , de ipmirdin man birra sii hupme .
nob: Det var først da jeg så ødeleggelsene at jeg forsto hva de snakket om .

source: Go mii bealjehis mánát vácciimet gávpogis , de dávjá soalddáhat adde midjiide njálgáid .
nob: Men når vi døve elever gikk i byen og brukte tegnspråk kom det av og til soldater til oss med godteri .

source: In diehtán maid galggaimet oaivvildit dasa .
nob: Jeg visste ikke ha vi skulle mene .

source: Ipmárdusamet servodaga birra oaččuimet dain eará ohppiin .
nob: Så tanker og forståelse for hva som skjedde i samfunnet fikk jeg gjennom samtaler med elever .

source: Skuvllas ohppen ovddemusta lohkat , čállit ja rehkenastit .
nob: På skolen lærte jeg først og fremst å lese , skrive og regne .

source: Gal bajásšaddamis bealjehemiid skuvllas ledje nai eará bealit .
nob: Oppveksten på døveskolen hadde sine sider den også .

source: Rikkis olbmuid mánát ožžo biktasiid ruovttus , ja hejotbirgejeaddji mánát ožžo daid skuvllas .
nob: De som hadde rike foreldre fikk klær hjemmefra og de som ikke var så godt bemidlet fikk fra skolen .

source: Mii nieiddažat buohkat gárvodeimmet ulločuvllaiguin ja firkaliiguin .
nob: Vi jentene gikk alle med ullkjoler og forklær .

source: Bártnážiin ledje gákkesbuvssat ja báidi .
nob: Guttene hadde vadmelsbukser og skjorte .

source: Ullobiktasiiguin satnjidii liikki issorasat ja mii ruohkaimet iežamet varaide .
nob: Ullklærne klødde noe forferdelig og vi klorte oss til blods .

source: Borramuš mis gal ii váilon , muhto lei gal ollu suvron borramuš man boraimet stállelihtiin .
nob: Vi manglet ikke mat , men det var mye sur mat.

source: Ja gohput ledje ruostasat , dat báidne borramuša .
nob: Vi spiste av stålkopper , som rustet og ga dårlig smak .

source: Buvrrus ledje dávjá ollu čoalttut , muhto fertiimet gazzat dan , buohkaide seamma dilli .
nob: Grøten var ofte full av klumper , men vi måtte spise og det var likt for alle .

source: Ohcalin iežamet joavkku issorasat , muhto ledjen goit dakkáriid searvvis geat ipmirdedje , ja mus ledje ustibat .
nob: Savnet etter familien var tungt , men jeg var i et miljø hvor jeg forsto og hadde venner .

source: Sierračálus Guovdageainnu skuvlastivrra beavdegirjjis 15/3-1947
nob: Utskrift av Kautokeino skolestyres møtebok for 15/3-1947

source: Finnmárkku fylkkamánni čállosa ref. 29/1 , ja bealjehemiid almmolaš skuvlla oahppi Troandimis Risten Sara 1946 eksámenduođaštus .
nob: Ref av skriv fra fylkesmannen i Finnmark av 29/1 , samt eksamensvitnesbyrd for 1946 for Risten Sara , elev ved Trondheim off .

source: Bealjehemiid dálueamitskuvla
nob: Husmorskolen for døve

source: – Maŋŋel go gergen bealjehemiid skuvllas , de vázzen bealjehemiid dálueamitskuvlla Stavangeris .
nob: – Etter at jeg var ferdig på døveskolen gikk jeg på husmorskole for døve i Stavanger .

source: Vázzen doppe guokte jagi .
nob: Jeg gikk der i to år .

source: Doppe olmmoš galggai oahppat ráhkadit borramuša , čorget viesu , goarrut ja čuoldit .
nob: Man skulle jo lære å lage mat , stelle hus , sy og veve .

source: Álggos vázzen doppe jagi , muhto sii oaivvildedje ahte mun ferten vázzit vel jagi doppe .
nob: Jeg gikk der først et år , men de mente det var for lite , så jeg måtte gå et år til .

source: Stavanger skuvla ja bealjehemiid báhppa dat ávžžuhedje mu joatkit .
nob: Det var skolen i Stavanger som anbefalte det , sammen med døvepresten .

source: Mus lei miella vázzit čuoldinsuorggi bealjehemiid skuvllas Hamaris .
nob: Jeg hadde lyst på vevlinjen på en skole for døve i Hamar .

source: Báhppa ii lean mielas dasa , ja nu šadden Stavangerii vel jagi .
nob: Presten syntes ikke om det , så det ble et år til i Stavanger .

source: Ii mu mielas lean Stavangera skuvla nu buorre .
nob: Jeg syntes ikke skolen i Stavanger var god .

source: Oaivvildin mun oahpašin eanet Hamaris , muhto olmmoš jeagadii dieđusge báhpa .
nob: Jeg mente at jeg kunne lære mer i Hamar , men man føyde seg etter presten .

source: Buorre bealli Stavangera skuvllas lei dattege ahte mun ohppen vuodjat doppe .
nob: En bra ting med skolen i Stavanger var likevel at vi lærte å svømme .

source: Eai dalle lean nu galle dakkár vejolašvuođa bealjehemiide .
nob: Det var ikke så mange valgmuligheter for døve den gang .

source: Go gergen Stavangeris , de bargen goarrun Ålesundas , muhto háliidin ruoktot ja vulgen Guovdageidnui .
nob: Da jeg var ferdig i Stavanger jobbet jeg som syerske i Ålesund , men ville hjem og dro til Kautokeino .

source: Doppe ožžon barggu biigán .
nob: Der fikk jeg jobb som hushjelp .

source: Galgen bargat sihke náveha ja viessobarggu muhtun joavkku luhtte .
nob: Jeg skulle stelle både i huset og fjøset hos en familie .

source: Das luhpen go ledjen biigon jagi ja báhcen ruoktot .
nob: Der sluttet jeg etter et år og ble hjemme .

source: Muittán áhči go jearai háliidivččen go bargat bohccuiguin .
nob: Jeg husker far spurte en gang om jeg ville være i reindrifta .

source: Ledjen vajálduhttán sámegiela in ge báljo gulahallan iežamet olbmuiguin .
nob: Jeg hadde mistet det samiske språket og det var vanskelig å kommunisere med familien .

source: Mis lei ollu oktasašvuohta , muhto ii oktasaš giella .
nob: Jeg hadde sterke bånd , men ikke felles språk .

source: Fertejin dárostit .
nob: Det måtte bli norsk .

source: Ja nu mun vulgen Osloi ja bargagohten lámpáfabrihkas .
nob: Så jeg dro til Oslo og begynte å jobbe på en lampefabrikk .

source: Bealjeheamit dat ledje mu ustibat .
nob: Jeg hadde venner blant døve .

source: Sápmelaš sámegiela haga
nob: Same uten samisk

source: Dál lea nu ahte lean iežan mielas sápmelaš , in rivgu , muhto in máhte gal giela .
nob: I dag er det slik at jeg føler meg samisk , ikke norsk , men jeg kan ikke språket .

source: Oahpahuvvojin iežan kultuvrras eret , muhto fertet muitit ahte nu lei dárbu .
nob: Jeg bruker norsk . Jeg ble skolert vekk fra min kultur , men husk at det var nødvendig .

source: Guovdageainnus ii lean máhtolašvuohta eai ge fálaldagat bealjehis ohppiide .
nob: Kautokeino hadde ikke kunnskap eller tilbud til døve elever .

source: Molssaeaktun dasa livččii ahte in lean obage beassat vázzit skuvlla .
nob: Alternativet hadde vært å ikke få skolegang i det hele tatt .

source: Mot de ?
nob: Hva da ?

source: Lea bávččas go olmmoš lea massán gielas ja kultuvrras , muhto ožžon dan giela sadjái eará giela mainna gulahalan .
nob: Det er vondt å ha mistet sitt språk og sin kultur , men jeg fikk et annet som jeg kan kommunisere på .

source: Mus lea maiddái kultuvrralaš gullevašvuohta bealjehemiid servodahkii .
nob: Jeg har også fått kulturtilhørighet til et døvemiljø .

source: Go dál oaidnalan iežan olbmuiguin , de sávašin máhttit sámegiela , muhto dalle ii lean hupmu ge beassat atnit sámegiela bealjehemiid skuvllas , juobeson vel giehtagiela oahppu min jovkui .
nob: Men den gang var det ikke snakk om samisk på døveskolen .

source: Mus lávii lagasvuohta vielljasan , muhto maŋŋel go ledjen jávkan nu guhká , de ii lean šat nu .
nob: Jeg hadde god kontakt med min bror . Etter å ha vært borte lenge og kommet tilbake som voksen , ble det ikke det samme .

source: Ean moai šat dovddadan .
nob: Vi kjente ikke hverandre .

source: Ollu earáhuvvá áiggi mielde , ja mun beahtahallen sakka go fuomášin ahte lean amasnuvvan .
nob: Ting endrer seg over år og jeg var veldig skuffet da jeg oppdaget at jeg var en fremmed .

source: Nu ollu lei dáhpáhuvvan daid vássán jagiid .
nob: Det var så mye som hadde skjedd på disse årene .

source: Mus lea buorre oktavuohta joavkkuinan , fulkkiiguin ja oahppásiiguin .
nob: Jeg har god kontakt med familie , slektninger og venner .

source: Sii leat maiddái leamaš viššalat finadit min luhtte Trøndelagas vássán jagiid .
nob: De har også vært flinke til å besøke meg i Trøndelag opp gjennom årene .

source: Goitge váilu juoga álo , dat jagit maid eat beassan vásihit ovttas .
nob: Men noe vil alltid mangle : De årene vi ikke hadde sammen .

source: Gullevašvuođa dovdu lassána dađistaga ja šaddá hui mávssolažžan .
nob: Tilknytningen blir sterkere og mer viktig med årene .

source: Ja dál lea ruhtadilli maiddái buoret .
nob: Og nå er også økonomien bedre .

source: Sáhtán finadit ruovttus iežan olbmuid luhtte , muhto mun in sáhte orrut doppe .
nob: Jeg kan reise hjem og besøke mine , men jeg kan ikke bo der .

source: Lean dávjá hui oktonas iežan kultuvrra dáfus .
nob: Jeg føler meg ofte ensom i min egen kultur .

source: Mus lea goitge lihkku , go mus leat iežan olbmot geat leat doalahan oktavuođa muinna .
nob: Men jeg er heldig som har familie som har holdt på kontakten . Det må jeg være glad for .

source: Ii sidjiide ge leat álki dárostit muinna .
nob: Det er heller ikke enkelt for dem å prate norsk til meg .

source: Lihkus leat sii nai leamaš hui čeahpit doalahit oktavuođa mu mánáiguin .
nob: Heldigvis har de også vært flinke til å holde kontakt med mine barn .

source: Lean giitevaš danne go eadnán sáddii mu bealjehemiid skuvlii .
nob: Jeg er takknemlig for at min mor sendte meg til døveskolen .

source: Dat lei duostilis dahku .
nob: Hun tok en modig avgjørelse .

source: Vaikko lean ge massán gielan , de ožžon goit oahpu juobe .
nob: Selv om det har kostet meg språket , så ga det meg en skolegang .

source: [ 1 ] Bealjehemiid ruoktu Andebus Vestfoldas ásahuvvui 1931:s .
nob: [ 1 ] Sølje[2 ] Sjal til samekofte[3 ] Hjemmet for døve i Andebu i Vestfold blei oppretta 1931 .

source: Lea dál oassin ásahusas Stiftelsen Signo .
nob: Det er nå en del av Stiftelsen Signo .

source: ( doaim . )
nob: Verdeordninga gikk i stor grad i oppløsning etter at reindriftsloven av 1978 satte forbud mot sytingsrein .

source: Eará artihkkalat girjjis Sámi skuvlahistorjá 4
nob: Flere artikler fra Samisk skolehistorie 4
